In [2]:
import pandas as pd

In [4]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
        'year':[2000,2001,2002,2001,2002,2003],
        'pop':[1.5,1.7,3.6,2.4,2.9,3.2]
}
frame = pd.DataFrame(data)

In [5]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [6]:
#选择前五行
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [7]:
pd.DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [13]:
#可以设置索引
frame1=pd.DataFrame(data,columns=['year','state','pop'],
            index = ['one','two','three','four','five','six']
            )
frame1

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9
six    2003  Nevada  3.2

In [14]:
#查看列
frame1['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [15]:
frame1['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [16]:
#查看行
frame1.loc['three']

year     2002
state    Ohio
pop       3.6
Name: three, dtype: object

In [17]:
frame2=pd.DataFrame(data,columns=['year','state','pop','debt'],
            index = ['one','two','three','four','five','six']
            )
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [18]:
#列的引用是可以修改的
frame2['dabt'] = 16.5
frame2

       year   state  pop debt  dabt
one    2000    Ohio  1.5  NaN  16.5
two    2001    Ohio  1.7  NaN  16.5
three  2002    Ohio  3.6  NaN  16.5
four   2001  Nevada  2.4  NaN  16.5
five   2002  Nevada  2.9  NaN  16.5
six    2003  Nevada  3.2  NaN  16.5

In [3]:
#使用del方法用于移除列
import pandas as pd
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
        'year':[2000,2001,2002,2001,2002,2003],
        'pop':[1.5,1.7,3.6,2.4,2.9,3.2]
}
frame1=pd.DataFrame(data,columns=['year','state','pop','debt'],
            index = ['one','two','three','four','five','six']
            )
frame1

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [4]:
#使用del方法用于移除列
del frame1['debt']
frame1.columns

Index(['year', 'state', 'pop'], dtype='object')

In [6]:
 #重建索引
frame2 = frame1.reindex(['one','two','three','four','five','six','seven'])
frame2

         year   state  pop
one    2000.0    Ohio  1.5
two    2001.0    Ohio  1.7
three  2002.0    Ohio  3.6
four   2001.0  Nevada  2.4
five   2002.0  Nevada  2.9
six    2003.0  Nevada  3.2
seven     NaN     NaN  NaN

In [8]:
#轴向上删除条目
import numpy as np
obj = pd.Series(np.arange(5.),index = ['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [9]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [10]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [13]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
index = ['Ohio','Colorado','Utah','New York'],
columns = ['one','two','tree','four'])
data

          one  two  tree  four
Ohio        0    1     2     3
Colorado    4    5     6     7
Utah        8    9    10    11
New York   12   13    14    15

In [14]:
data

TypeError: 'NoneType' object is not callable